Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/telecommunications_and_postal_services/fixed_line_telephone_services_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Fixed line telephone services
ga: Seirbhísí teileafóin líne seasta

source: Many companies in Ireland offer fixed line telephone services to consumers
ga: Tá a lán comhlachtaí in Éirinn a sholáthraíonn seirbhísí teileafóin líne seasta do thomhaltóirí

source: Fixed line means that your telephone is not wire free but physically connected to a point on a wall in your home or office
ga: Ciallaíonn líne seasta go bhfuil nasc idir do theileafón agus pointe balla i do theach nó i d’oifig

source: The type of fixed line service you choose will depend on your needs
ga: Is féidir leat seirbhís theileafóin líne seasta a roghnú, a chomhlíonann do riachtanais

source: Universal Service Obligation (USO)
ga: Dualgas Seirbhíse Uilíoch (USP)

source: Before the telecommunications market was liberalised in the late 1990s, all telecommunications services in Ireland were provided by State company Telecom Éireann
ga: Roimh léirscaoileadh an mhargaidh teileachumarsáide ag deireadh na nochaidí, ba é an comhlacht stáit, Telecom Éireann, a sholáthair seirbhísí teileachumarsáide in Éirinn

source: Telecom Éireann was privatised in 1999 and is now known as Eir
ga: Rinneadh Telecom Éireann a phríobháidiú i 1999 agus tugtar Eir air anois

source: ComReg, the regulator for the electronic communications and postal sectors, has put in place a system to ensure that a basic set of telecommunications services is available to all consumers throughout the country
ga: Tá ComReg, rialtóir don earnáil leictreonach, teileachumarsáide agus poist, freagrach as córas a chur i bhfeidhm chun deimhin a dhéanamh de go bhfuil bunseirbhísí ar fáil do na tomhaltóirí go léir ar fud na tíre

source: This is known as the principle of Universal Service
ga: Tugtar Dualgas Seirbhíse Uilíoch ar an bprionsabal seo

source: Eir is the designated Universal Service Provider (USP) and has a number of obligations regarding the supply of certain services
ga: Is é Eir an Soláthraí Seirbhíse Uilíoch (USP) agus mar thoradh ar seo, bíonn ar an gcomhlacht roinnt dualgais a chomhlíonadh maidir le soláthar seirbhísí áirithe

source: You can find out more about the Universal Service Obligation on ComReg’s website
ga: Is féidir leat breis faisnéise a rochtain ar Dhualghas Seirbhíse Uilíoch ar láithreán gréasáin ComReg

source: Choosing or changing your service provider
ga: Ag roghnú nó ag athrú soláthraithe seirbhíse

source: Your relationship with a telephone service provider is based on a consumer contract
ga: Tá an caidreamh idir tomhaltóir agus soláthraí seirbhíse teileafóin bunaithe ar chonradh tomhaltóra

source: When shopping around it is important to compare the different terms and conditions which apply in different contracts. These may include, for example, prices for line rental and calls
ga: Nuair a dhéantar imscrúdú ar na comhlachtaí difriúla, is rud tábhachtach é comparáid a dhéanamh idir na téarmaí agus na coinníollacha difriúla a bhaineann le conarthaí difriúla, mar shampla, an t-airgead go gcaithfear a íoc do chíos líne nó do ghlaonna

source: Before you change contracts, it is wise to know the specific terms and conditions of your current contract so that you can compare them to the terms and conditions of a new contract
ga: Roimh conradh a shíniú le comhlacht nua, ba chóir dhuit imscrúdú a dhéanamh ar théarmaí agus ar choinníollacha an chonartha atá agat faoi láthair chun iad a chur i gcomparáid le téarmaí agus coinníollacha an chonartha nua

source: You should also review a few of your most recent telephone bills and establish your calling pattern (i.e
ga: Ba cheart duit athbhreithniú a dhéanamh ar cheann nó dhó de bhur mbillí teileafóin is déanaí, chomh maith le do phatrún glaoite a leagadh amach (is é sin ná na huimreacha a chuireann tú glaoch orthu go minic agus an t-am a chuireann tú glaoch ar na huimreacha seo)

source: what type of calls you frequently make and at what time of day), and then shop around and ask the different companies about their call charges
ga: Ina dhiaidh sin, ba chóir duit faisnéis a lorg ó na comhlachtaí difriúla ar a dtáillí glaoite

source: You should ask each operator to provide you with a printed price list in order to check and compare tariffs
ga: Ba chóir duit ceist a chur ar gach oibritheoir, liosta clóite a sheoladh chugat chun a bheith in ann imscrúdú a dhéanamh ar tháillí agus comparáid a dhéanamh idir na táillí difriúla

source: The following questions will also assist you in making your decision:
ga: Is féidir leat na ceisteanna seo a leanas a úsáid freisin chun cinneadh a dhéanamh:

source: • Is there a minimum charge or a set up charge for each call you make?
ga: • An bhfuil íostáille nó táille tosaigh le híoc nuair a dhéantar glaoch teileafóin?

source: • How does the phone company charge for calls - per second or per minute?
ga: • Conas a dhéanann an comhlacht teileafóin táillí glaoite a leagadh amach – in aghaidh an soicind nó an nóiméid?

source: • Are there any additional charges such as connection fees?
ga: • An bhfuil táillí breise le híoc, mar shampla, táillí cónaisc?

source: • What are their day, evening and weekend times?
ga: • Cathain a thosaíonn agus a chríochnaíonn na rátaí lae, tráthnóna agus deireadh seachtaine?

source: • How long is the change over likely to take?
ga: • Cé mhéid ama a thógfaidh sé chun aistriú go dtí an t-seirbhís nua?

source: • Do you need to sign up for a set period of time?
ga: • An bhfuil ort conradh am-bhunaithe a shíniú?

source: • Do you have to spend a minimum amount per month?
ga: • An bhfuil íosmhéid airgid le híoc in aghaidh na míosa?

source: • Are there any special discount schemes?
ga: • An bhfuil scéimeanna lascaine speisialta ar fáil?

source: • What penalties will be applied if you decide to opt-out of your contract obligations early?
ga: • An bhfuil pionóis le híoc má chuireann tú deireadh le do chonradh?

source: It is also important to note that you may need to contact your existing operator in advance of changing service provider to check to see if any cancellation notice or cancellation period/penalties apply
ga: Tá sé tábhachtach a thabhairt faoi deara freisin teagmháil a dhéanamh leis an oibritheoir atá agat faoi láthair roimh chonradh a shíniú le soláthraí seirbhíse nua, chun faisnéis a fháil ar fhógraí nó ar thréimhse phionóis chealúcháin

source: Switching your fixed line service provider normally takes approximately 10 days from the date you signed-up
ga: Is gnách go nglacann sé thart ar 10 lá ón dáta a shínigh tú chun do sholáthraí seirbhíse líne seasta a aistriú

source: You should ask your new service provider about its commitments about switching in its code of practice and customer guarantee scheme
ga: Ba cheart duit iarraidh ar do sholáthraí seirbhíse nua faoina ghealltanais faoi aistriú atá ina chód cleachtais agus ina scéim ráthaíochta do chustaiméirí

source: Under EU rules the porting of numbers and their subsequent activation shall be carried out within the shortest possible time
ga: Faoi rialacha an AE, tabharfar faoi uimhreacha a aistriú agus iad a ghníomhachtú, ina dhiaidh sin, laistigh den am is giorra agus is féidir

source: When you have concluded an agreement to port a number to a new service, that number should be activated within one working day
ga: Nuair atá comhaontú tugtha chun críche agat chun uimhir a aistriú chuig seirbhís nua, déanfar an uimhir sin a ghníomhachtú laistigh de lá oibre amháin

source: All you need to do to change service provider is either sign a contract or indicate over the telephone that you would like to subscribe to a new service provider
ga: Níl ort ach conradh a shíniú nó glaoch teileafóin a chur ar sholáthraí seirbhíse nua chun a chur in iúl dóibh gur mhaith leat a sheirbhísí a úsáid

source: The process of giving your consent to a service provider by phone is known as Third Party Verification (TPV for short) and involves a series of questions that you need to answer
ga: Nuair a thugann tú cead ar an teileafón do sholáthraí seirbhíse é seo a dhéanamh, tugtar Fiorú Tríú Páirtí (nó TPV) ar seo. Mar chuid den phróiseas seo, bíonn ort roinnt cheisteanna a fhreagairt

source: The TPV is recorded and is as legally binding as signing a contract
ga: Cláraítear an TPV agus féachtar air mar chonradh dleathach

source: The new service provider will contact your old service provider to let them know that you will no longer need their services
ga: Déanfaidh do sholáthraí seirbhíse nua teagmháil le do shean-soláthraí seirbhíse chun é a chur in iúl dóibh gur mhaith leat deireadh a chur le do chonradh

source: Your old service provider will then write a letter to you stating that you have consented to changing service providers
ga: Ina dhiaidh sin, gheobhaidh tú litir ó do shean-soláthraí seirbhíse a léireoidh go dtoilíonn tú aistriú go soláthraí seirbhíse nua

source: You only need to reply to this letter if you do not wish to change your service provider
ga: Níl ort freagra a sheoladh ar ais, ach amháin mura mian leat do sholáthraí seirbhíse a athrú

source: Companies offering fixed line telephone services to Irish consumers need to be authorised by ComReg
ga: Bíonn ar chomhlachtaí a sholáthraíonn seirbhísí teileafóin líne seasta do thomhaltóirí Éireannacha údarú a fháil ó ComReg

source: If you have entered into a contract with a new service provider, you may have a minimum cooling off period (your rights depend on the nature of the contract and the method of sale)
ga: Má d’iontráil tú i gconradh le soláthraí seirbhíse nua, b’fhéidir go mbeidh tréimhse íosta aithrí agat (braitheann do chuid ceart ar chineál an chonartha agus ar an modh díolta)

source: You should ask your new provider, when signing up about a cooling off period and how to cancel the contract within this period
ga: Ba cheart duit fiafraí de do sholáthraí nua, nuair a bhíonn tú ag clárú, faoi thréimhse aithrí agus conas an conradh a chealú laistigh den tréimhse seo

source: Direct marketing and telephone service providers
ga: Margaíocht dhíreach agus soláthraithe seirbhíse teileafóin

source: Telephone service providers often circulate material advertising their services
ga: Déanann soláthraithe seirbhíse teileafóin a seirbhísí a mhargú go minic

source: If you do not wish to receive direct marketing calls from any company you can register this preference with the National Directory Database
ga: Mura mian leat glaonna margaíochta díreach a fháil ó chomhlachtaí, is féidir leat é seo a chur in iúl don Bhunachar Sonraí Eolaí Náisiúnta

source: Read about dealing with unwanted telephone sales calls
ga: Cliceáil anseo chun níos mó faisnéise a rochtain ar conas déileáil le glaonna teileafóin neamhcheadaithe

source: After you have changed service providers your old service provider cannot contact you in relation to your service for three months
ga: Nuair a aistríonn tú go soláthraithe seirbhíse nua, níl cead ag do shean-soláthraithe seirbhíse teagmháil a dhéanamh leat ar feadh trí mhí ar a laghad

source: Consumers now have the option of choosing single billing which means that you receive just one bill from the service provider of your choice for every aspect of your telephone service requirements - including all calls and line rental
ga: Is féidir le tomhaltóirí billeáil aonair a roghnú chun bille amháin a fháil óna soláthraí seirbhíse tosaíochta, a chuireann san áireamh ceanglais seirbhíse teileafóin iomlána an tomhaltóra – lena n-airítear glaonna agus cíos líne

source: You will have to check that your chosen service provider does offer the single billing facillity
ga: Ní mór duit ceist a chur ar do sholáthraí seirbhíse chun a fháil amach an féidir leat bille aonair a fháil

source: Regarding ancillary services, such as call waiting or call answering etc., you will need to contact your new operator to ask if these are available
ga: Beidh ort teagmháil a dhéanamh le d’oibritheoir nua chun ceisteanna a chur air maidir le seirbhísí coimhdeachta, mar shampla glao ag feitheamh, glao fregartha agus araile

source: Your internet settings and broadband services should not be affected if you select a new service provider for line rental and calls. Your new service provider will provide you with further details
ga: De ghnáth, is féidir leat na seirbhísí céanna idirlín agus leathanbhanda a úsáid nuair a roghnaíonn tú soláthraí seirbhíse teileafóin nua Is féidir leat breis faisnéise a fháil ó do sholáthraí seirbhíse nua

source: You can read ComReg’s leaflet Introducing Single Billing (pdf)
ga: Is féidir leat bileog ComReg Cur Síos ar Bhilleáil Aonair (pdf) a rochtain anseo

source: Carrier Pre-Selection (CPS) allows you to opt in advance for certain types of calls, such as international calls, to be carried by a particular operator
ga: De réir Réamhroghnaithe Iompróra (CPS), is féidir leat oibritheoir áirithe a roghnú roimh ré, chun glaonna áirithe a iompair, mar shampla glaonna idirnáisiúnta

source: There is no need to dial a prefix or follow any different procedure prior to connecting the call
ga: Níl ort réimír a dhiailiú nó aon rud eile a dhéanamh roimh ghlaoch a chur ar an uimhir

source: You receive two separate bills – one from your CPS operator for call charges and one from your line rental provider
ga: Faigheann tú dhá bhille – ceann amháin ó d’oibritheoir CPS do tháillí glaonna agus an dara cheann ó do sholáthraí seirbhíse cíosa líne

source: If you have an issue with your telephone service provider, you should contact your provider, outline your complaint and ask for it to be resolved
ga: Bíonn ort rátaí difriúla a íoc bunaithe ar an soláthraí seirbhíse a roghnaíonn tú, ar na sóirt glaonna a dhéanann tú agus ar an am a dhéanann tú na glaonna seo

source: If you are not satisfied with the outcome you should contact ComReg who may be able to help resolve the issue. Information on making a complaint to ComReg is available on its consumer website
ga: Is féidir leat féin imscrúdú a dhéanamh ar na rátaí difriúla chun an luach ar airgead is fearr a fháil bunaithe ar na glaonna a dhéanann tú agus ar na seirbhísí a dteastaíonn uait

source: Different service providers charge different rates depending on the type of call you are making and when you make the call. It’s up to you to research the different rates to see where you can get best value for money based on your calling pattern and services you want to use
ga: Soláthraíonn ComReg láithreán gréasáin ar a dtugtar www.callcosts.ie a chuireann ar chumas tomhaltóirí comparáid a dhéanamh idir táillí teileafóin líne seasta ar fud gach oibreoir

source: ComReg's website allows consumers to compare fixed line telephone charges across all operators. The site assists consumers to select the optimum phone package, based on their individual usage
ga: Cuidíonn an láithreán le tomhaltóirí an pacáiste teileafóin is fearr is féidir a roghnú, bunaithe ar a n-úsáid aonair

source: ComReg provides information which may help you choose a service provider
ga: Tá roinnt foilseacháin ar fáil ó ComReg gur féidir le tomhaltóirí a úsáid chun soláthraí seirbhíse a roghnú
